submission_logs/2_1_1_one_middleware_reduced/8/7/0-1/2/memtier/1.log
1         Threads
7         Connections per thread
80        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec 
------------------------------------------------------------------------
Sets           0.00          ---          ---      0.00000         0.00 
Gets        2934.22      2894.64        39.57      2.37800     11725.82 
Waits          0.00          ---          ---      0.00000          --- 
Totals      2934.22      2894.64        39.57      2.37800     11725.82 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
---
GET       0.750         0.00
GET       0.760         0.00
GET       0.790         0.00
GET       0.800         0.00
GET       0.810         0.00
GET       0.820         0.00
GET       0.830         0.01
GET       0.840         0.01
GET       0.850         0.01
GET       0.860         0.01
GET       0.870         0.01
GET       0.880         0.02
GET       0.890         0.02
GET       0.900         0.03
GET       0.910         0.04
GET       0.920         0.06
GET       0.930         0.07
GET       0.940         0.09
GET       0.950         0.12
GET       0.960         0.15
GET       0.970         0.19
GET       0.980         0.24
GET       0.990         0.29
GET       1.000         0.86
GET       1.100         3.29
GET       1.200         8.35
GET       1.300        15.90
GET       1.400        25.17
GET       1.500        35.00
GET       1.600        44.22
GET       1.700        52.51
GET       1.800        59.46
GET       1.900        64.94
GET       2.000        69.14
GET       2.100        72.51
GET       2.200        75.02
GET       2.300        76.99
GET       2.400        78.51
GET       2.500        79.79
GET       2.600        80.77
GET       2.700        81.61
GET       2.800        82.37
GET       2.900        83.02
GET       3.000        83.60
GET       3.100        84.12
GET       3.200        84.58
GET       3.300        84.98
GET       3.400        85.36
GET       3.500        85.71
GET       3.600        86.06
GET       3.700        86.39
GET       3.800        86.70
GET       3.900        87.01
GET       4.000        87.31
GET       4.100        87.61
GET       4.200        87.89
GET       4.300        88.19
GET       4.400        88.47
GET       4.500        88.74
GET       4.600        89.03
GET       4.700        89.33
GET       4.800        89.62
GET       4.900        89.92
GET       5.000        90.22
GET       5.100        90.51
GET       5.200        90.80
GET       5.300        91.11
GET       5.400        91.43
GET       5.500        91.74
GET       5.600        92.06
GET       5.700        92.39
GET       5.800        92.75
GET       5.900        93.12
GET       6.000        93.50
GET       6.100        93.85
GET       6.200        94.21
GET       6.300        94.56
GET       6.400        94.91
GET       6.500        95.26
GET       6.600        95.62
GET       6.700        95.99
GET       6.800        96.30
GET       6.900        96.62
GET       7.000        96.93
GET       7.100        97.18
GET       7.200        97.45
GET       7.300        97.69
GET       7.400        97.91
GET       7.500        98.12
GET       7.600        98.29
GET       7.700        98.46
GET       7.800        98.59
GET       7.900        98.70
GET       8.000        98.80
GET       8.100        98.88
GET       8.200        98.95
GET       8.300        99.01
GET       8.400        99.06
GET       8.500        99.10
GET       8.600        99.15
GET       8.700        99.18
GET       8.800        99.21
GET       8.900        99.24
GET       9.000        99.26
GET       9.100        99.29
GET       9.200        99.31
GET       9.300        99.34
GET       9.400        99.36
GET       9.500        99.38
GET       9.600        99.40
GET       9.700        99.41
GET       9.800        99.43
GET       9.900        99.44
GET      10.000        99.51
GET      11.000        99.58
GET      12.000        99.62
GET      13.000        99.64
GET      14.000        99.66
GET      15.000        99.68
GET      16.000        99.71
GET      17.000        99.74
GET      18.000        99.77
GET      19.000        99.84
GET      20.000        99.89
GET      21.000        99.92
GET      22.000        99.93
GET      23.000        99.93
GET      24.000        99.94
GET      25.000        99.94
GET      26.000        99.95
GET      27.000        99.96
GET      28.000        99.97
GET      29.000        99.98
GET      30.000        99.98
GET      31.000        99.99
GET      32.000        99.99
GET      34.000        99.99
GET      35.000        99.99
GET      36.000        99.99
GET      37.000       100.00
GET      38.000       100.00
GET      39.000       100.00
GET      44.000       100.00
---